{
  "metadata": {
    "total_parameters": 1774566400,
    "total_size": 7098265600
  },
  "weight_map": {
    "decoder.0.input_proj.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.0.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.0.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.0.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.0.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.0.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.0.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.0.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.0.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.0.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.0.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.1.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.1.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.1.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.1.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.1.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.1.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.1.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.1.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.1.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.1.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.10.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.10.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.10.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.10.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.10.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.10.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.10.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.10.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.10.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.10.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.11.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.11.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.11.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.11.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.11.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.11.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.11.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.11.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.11.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.11.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.12.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.12.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.12.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.12.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.12.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.12.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.12.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.12.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.12.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.12.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.13.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.13.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.13.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.13.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.13.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.13.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.13.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.13.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.13.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.13.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.14.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.14.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.14.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.14.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.14.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.14.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.14.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.14.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.14.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.14.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.15.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.15.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.15.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.15.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.15.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.15.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.15.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.15.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.15.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.15.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.16.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.16.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.16.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.16.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.16.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.16.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.16.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.16.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.16.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.16.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.17.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.17.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.17.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.17.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.17.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.17.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.17.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.17.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.17.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.17.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.18.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.18.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.18.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.18.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.18.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.18.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.18.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.18.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.18.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.18.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.19.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.19.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.19.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.19.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.19.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.19.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.19.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.19.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.19.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.19.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.2.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.2.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.2.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.2.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.2.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.2.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.2.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.2.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.2.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.2.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.20.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.20.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.20.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.20.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.20.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.20.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.20.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.20.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.20.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.20.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.21.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.21.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.21.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.21.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.21.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.21.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.21.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.21.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.21.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.21.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.22.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.22.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.22.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.22.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.22.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.22.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.22.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.22.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.22.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.22.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.23.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.23.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.23.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.23.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.23.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.23.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.23.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.23.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.23.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.23.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.24.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.24.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.24.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.24.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.24.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.24.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.24.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.24.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.24.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.24.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.25.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.25.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.25.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.25.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.25.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.25.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.25.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.25.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.25.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.25.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.26.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.26.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.26.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.26.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.26.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.26.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.26.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.26.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.26.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.26.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.27.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.27.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.27.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.27.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.27.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.27.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.27.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.27.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.27.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.27.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.28.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.28.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.28.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.28.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.28.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.28.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.28.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.28.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.28.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.28.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.29.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.29.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.29.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.29.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.29.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.29.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.29.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.29.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.29.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.29.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.3.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.3.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.3.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.3.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.3.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.3.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.3.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.3.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.3.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.3.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.30.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.30.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.30.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.30.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.30.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.30.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.30.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.30.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.30.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.30.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.31.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.31.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.31.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.31.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.31.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.31.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.31.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.31.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.31.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.31.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.0.transformer.layers.4.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.4.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.4.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.4.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.4.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.4.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.4.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.4.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.4.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.4.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.5.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.5.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.5.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.5.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.5.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.5.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.5.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.5.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.5.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.5.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.6.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.6.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.6.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.6.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.6.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.6.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.6.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.6.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.6.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.6.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.7.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.7.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.7.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.7.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.7.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.7.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.7.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.7.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.7.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.7.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.8.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.8.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.8.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.8.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.8.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.8.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.8.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.8.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.8.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.8.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.9.layer_scale_1.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.9.layer_scale_2.scale": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.9.linear1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.9.linear2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.9.norm1.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.9.norm1.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.9.norm2.bias": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.9.norm2.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.9.self_attn.in_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.0.transformer.layers.9.self_attn.out_projs.0.weight": "model-00001-of-00002.safetensors",
    "decoder.2.input_proj.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.0.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.0.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.0.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.0.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.0.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.0.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.0.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.0.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.0.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.0.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.1.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.1.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.1.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.1.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.1.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.1.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.1.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.1.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.1.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.1.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.10.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.10.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.10.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.10.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.10.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.10.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.10.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.10.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.10.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.10.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.11.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.11.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.11.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.11.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.11.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.11.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.11.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.11.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.11.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.11.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.2.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.2.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.2.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.2.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.2.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.2.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.2.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.2.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.2.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.2.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.3.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.3.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.3.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.3.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.3.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.3.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.3.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.3.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.3.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.3.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.4.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.4.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.4.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.4.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.4.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.4.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.4.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.4.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.4.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.4.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.5.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.5.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.5.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.5.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.5.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.5.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.5.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.5.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.5.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.5.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.6.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.6.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.6.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.6.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.6.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.6.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.6.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.6.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.6.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.6.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.7.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.7.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.7.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.7.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.7.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.7.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.7.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.7.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.7.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.7.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.8.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.8.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.8.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.8.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.8.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.8.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.8.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.8.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.8.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.8.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.9.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.9.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.9.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.9.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.9.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.9.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.9.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.9.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.9.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.2.transformer.layers.9.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.input_proj.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.0.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.0.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.0.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.0.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.0.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.0.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.0.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.0.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.0.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.0.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.1.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.1.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.1.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.1.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.1.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.1.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.1.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.1.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.1.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.1.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.10.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.10.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.10.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.10.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.10.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.10.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.10.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.10.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.10.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.10.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.11.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.11.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.11.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.11.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.11.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.11.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.11.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.11.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.11.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.11.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.2.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.2.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.2.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.2.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.2.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.2.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.2.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.2.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.2.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.2.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.3.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.3.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.3.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.3.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.3.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.3.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.3.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.3.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.3.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.3.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.4.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.4.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.4.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.4.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.4.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.4.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.4.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.4.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.4.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.4.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.5.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.5.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.5.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.5.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.5.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.5.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.5.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.5.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.5.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.5.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.6.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.6.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.6.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.6.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.6.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.6.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.6.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.6.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.6.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.6.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.7.layer_scale_1.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.7.layer_scale_2.scale": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.7.linear1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.7.linear2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.7.norm1.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.7.norm1.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.7.norm2.bias": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.7.norm2.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.7.self_attn.in_projs.0.weight": "model-00002-of-00002.safetensors",
    "decoder.4.transformer.layers.7.self_attn.out_projs.0.weight": "model-00002-of-00002.safetensors",
